{
  "name": "pacman",
  "description": "Updates package list for pacman and has LWRP for pacman groups",
  "long_description": "DESCRIPTION\n===========\n\nRefreshes the pacman package cache from the FTP servers and provides LWRPs related to pacman\n\nREQUIREMENTS\n============\n\nPlatform: ArchLinux. Pacman is not relevant on other platforms.\n\nRESOURCES\n=========\n\n`pacman_group`\n--------------\n\nUse the `pacman_group` resource to install or remove pacman package groups. Note that at this time the LWRP will check if the group is installed but doesn't do a lot of error checking or handling. File a ticket on the COOK project at tickets.opscode.com for improvements and feature requests.\n\nThe `options` parameter can be used to pass arbitrary options to the pacman command.\n\n`pacman_aur`\n------------\n\nUse the `pacman_aur` resource to install packages from ArchLinux's AUR repository.\n\n### Actions:\n\n* :build - Builds the package.\n* :install - Installs the built package.\n\n### Parameters:\n\n* version - hardcode a version\n* builddir - specify an alternate build directory, defaults to `Chef::Config[:file_cache_path]/builds`.\n* options - pass arbitrary options to the pacman command.\n* `pkgbuild_src` - whether to use an included PKGBUILD file, put the PKGBUILD file in in the `files/default` directory.\n* patches - array of patch names, as files in `files/default` that should be applied for the package.\n\nhttp://aur.archlinux.org/\n\nUSAGE\n=====\n\nInclude `recipe[pacman]` early in the run list, preferably first, to ensure that the package caches are updated before trying to install new packages.\n\n\nLICENSE AND AUTHOR\n==================\n\nAuthor:: Joshua Timberman (<joshua@opscode.com>)\n\nCopyright:: Opscode, Inc. (<legal@opscode.com>)\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n",
  "maintainer": "Opscode, Inc.",
  "maintainer_email": "cookbooks@opscode.com",
  "license": "Apache 2.0",
  "platforms": {
  },
  "dependencies": {
  },
  "recommendations": {
  },
  "suggestions": {
  },
  "conflicting": {
  },
  "providing": {
  },
  "replacing": {
  },
  "attributes": {
  },
  "groupings": {
  },
  "recipes": {
  },
  "version": "1.0.1"
}