{
  "name": "teamspeak3",
  "description": "Installs and starts teamspeak3 as a runit service.",
  "long_description": "DESCRIPTION\n===========\n\nInstalls the Teamspeak 3 beta release.\n\nATTRIBUTES\n==========\n\nAttributes are in the `ts3` keyspace.\n\n* version - Specifies the version to download and set up version-specific directories. This is an override attribute so the default attributes get set correctly with it.\n* arch - Specifies the architecture to download based on the node.kernel.machine. Valid values are amd64 or x86.\n* url - Download URL to use. Note that the teamspeak releases are in a version specific subdirectory that isn't detected automatically, and must be modified manually when updating the version to use.\n\nUSAGE\n=====\n\nInclude the teamspeak3 recipe on a node's run list to have it download and install Teamspeak 3. The software is under active development and upgrades are not handled automatically. The related attributes (see above) need to be modified for new versions, and those will be downloaded and installed. The database will be preserved for upgrades.\n\nThe Teamspeak server process will be started as a runit service. When the service is started for the first time, the runit log output (by default /etc/sv/teamspeak3/log/main/current) will have the relevant password information to manage the Teamspeak server.\n\nLICENSE AND AUTHOR\n==================\n\nAuthor:: Joshua Timberman <joshua@housepub.org>\n\nCopyright 2009-2010, Joshua Timberman\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n",
  "maintainer": "Opscode",
  "maintainer_email": "joshua@opscode.com",
  "license": "Apache 2.0",
  "platforms": {
  },
  "dependencies": {
    "runit": [

    ]
  },
  "recommendations": {
  },
  "suggestions": {
  },
  "conflicting": {
  },
  "providing": {
  },
  "replacing": {
  },
  "attributes": {
  },
  "groupings": {
  },
  "recipes": {
  },
  "version": "0.2.1"
}
