{
  "name": "selinux",
  "description": "Installs/Configures selinux",
  "long_description": "Description\n===========\n\nProvides recipes for manipulating selinux policy enforcement\n\nRequirements\n============\n\nRHEL family distribution or other Linux system that uses SELinux.\n\n## Platform:\n\nTested on RHEL 5.6, 6.0 and 6.1.\n\nUsage\n=====\n\nSELinux is enforcing by default on RHEL family distributions, however the use of SELinux has complicated considerations when using configuration management. Often, users are recommended to set SELinux to permissive mode, or disabled completely. To ensure that SELinux is permissive or disabled, choose the appropriate recipe (`selinux::permissive`, `selinux::disabled`) and apply it to the node early in the run list. For example in a `base` role used by all RHEL systems:\n\n    name \"base\"\n    description \"Base role applied to all nodes.\"\n    run_list(\n      \"recipe[selinux::permissive]\",\n    )\n\nChanges\n=======\n\n## v0.5.0:\n\n* COOK-678 - add the selinux cookbook to the repository\n* Use main selinux config file (/etc/selinux/config)\n* Use getenforce instead of selinuxenabled for enforcing and permissive\n\nRoadmap\n=======\n\nUse a node attribute to determine which recipe to load automatically from selinux::default.\n\nAdd LWRP/Libraries for manipulating security contexts for files and services managed by Chef.\n\nLicense and Author\n==================\n\nAuthor:: Sean OMeara (<someara@opscode.com>)\nAuthor:: Joshua Timberman (<joshua@opscode.com>)\n\nCopyright:: 2011, Opscode, Inc\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n",
  "maintainer": "Opscode, Inc.",
  "maintainer_email": "someara@opscode.com",
  "license": "Apache",
  "platforms": {
  },
  "dependencies": {
  },
  "recommendations": {
  },
  "suggestions": {
  },
  "conflicting": {
  },
  "providing": {
  },
  "replacing": {
  },
  "attributes": {
  },
  "groupings": {
  },
  "recipes": {
  },
  "version": "0.5.0"
}